Autodesk.Revit.DB.ElementMulticlassFilter.#ctor(System.Collections.Generic.IList{System.Type},System.Boolean)
Constructs a new instance of a filter to find elements whose Element subclasses matches any of a given set of input classes, with an option to instead match
elements whose Element subclass does not match the list of input classes.
typeList:
The list of Element subclass types to match.
inverted:
True if the filter should match all elements which are not of the given Element subclass.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more input types are not valid subclasses of Element for this filter.
-or-
One or more of the types do not exist in Revit's native object model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementMulticlassFilter.#ctor(System.Collections.Generic.IList{System.Type})
Constructs a new instance of a filter to find elements whose Element subclasses matches any of a given set of input classes.
typeList:
The list of Element subclass types to match.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more input types are not valid subclasses of Element for this filter.
-or-
One or more of the types do not exist in Revit's native object model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementMulticlassFilter
A filter used to match elements by their class, where more than one class of element may be passed.
Remarks:
This filter is a quick filter.
Quick filters operate only on the ElementRecord, a low-memory class which has
a limited interface to read element properties. Elements which are rejected
by a quick filter will not be expanded in memory.
Only elements whose class is an exact match to one of the input classes,
or elements whose type is derived from the input class will pass the collector.There is a small subset of Element subclasses in the API that are not supported
by this filter.  These classes exist in the API, but not in Revit's native object model,
which means that this filter doesn't support them.  In order to use a class filter to
find elements of these types, it is necessary to use a higher level class and then
process the results further to find elements matching only the subclass. For a list
of subclasses affected by this restriction, consult the documentation for Autodesk::Revit::DB::ElementClassFilter.
Since:
2012